Revit 2027 API
PathReinSpanSymbol Class
 Represents a Path Reinforcement Span Symbol element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PathReinSpanSymbol : IndependentTag
Public Class PathReinSpanSymbol
	Inherits IndependentTag
public ref class PathReinSpanSymbol : public IndependentTag
type PathReinSpanSymbol =
    class
        inherit IndependentTag
    end
The PathReinSpanSymbol type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasLeader |  Identifies if a tag has at least one visible leader, or if all leaders are hidden.
(Inherited from IndependentTag)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsMaterialTag |  Identifies if it is a material tag or not.
(Inherited from IndependentTag)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMulticategoryTag |  Identifies if it is a multi-category tag or not.
(Inherited from IndependentTag)
IsOrphaned |  Identifies if the tag is orphaned or not.
(Inherited from IndependentTag)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LeaderEndCondition |  The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
(Inherited from IndependentTag)
LeadersPresentationMode |  Identifies the Presentation Mode that is applied to tag leaders.
(Inherited from IndependentTag)
LeaderStartCondition |  The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
(Inherited from IndependentTag)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
MergeElbows |  Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
(Inherited from IndependentTag)
MultiLeader |  Returns if the tag if referencing multiple elements and/or sub-elements.
(Inherited from IndependentTag)
MultiReferenceAnnotationId |  The multi-reference annotation which owns this tag.
(Inherited from IndependentTag)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
RotationAngle |  The rotation angle of the tag relative to its view
(Inherited from IndependentTag)
TagHeadPosition |  The position of the head of tag in model coordinates.
(Inherited from IndependentTag)
TagOrientation |  The tag orientation of the tag's head, such as horizontal or vertical.
(Inherited from IndependentTag)
TagText |  The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
(Inherited from IndependentTag)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
AddReferences |  Adds the provided list of references to the tag's list of references.
(Inherited from IndependentTag)
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
CanLeaderEndConditionBeAssigned |  Checks whether the LeaderEndCondition can be changed.
(Inherited from IndependentTag)
CanLeaderStartConditionBeAssigned |  Checks whether the LeaderStartCondition can be changed.
(Inherited from IndependentTag)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create |  Creates a new instance of PathReinSpanSymbol in the project.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLeaderElbow |  Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.
(Inherited from IndependentTag)
GetLeaderEnd |  Gets the free end point for the leader to the specified reference.
(Inherited from IndependentTag)
GetLeaderStart |  Gets the free leader start point for the leader to the specified reference.
(Inherited from IndependentTag)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetTaggedElementIds |  Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
(Inherited from IndependentTag)
GetTaggedLocalElementIds |  Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each subelement that is being referenced by the tag. Set of all the element ids in the local file. For each subelement a local element id will be provided.
(Inherited from IndependentTag)
GetTaggedLocalElements |  Get the tagged local elements, if any. An Element will be provided for each subelement that is being referenced by the tag.
(Inherited from IndependentTag)
GetTaggedReferences |  Get the host references of the tag. An array of all the tagged references.
(Inherited from IndependentTag)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasLeaderElbow |  Whether the tag's leader that points to the reference has an elbow point or not.
(Inherited from IndependentTag)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
HasTagBehavior |  Checks if the IndependentTag has a tag behavior.
(Inherited from IndependentTag)
HasTagText |  Checks if the IndependentTag has a valid tag text.
(Inherited from IndependentTag)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsLeaderVisible |  Returns if leader that points to specified reference is visible or not.
(Inherited from IndependentTag)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsTaggedOnSubelement |  Returns true if the any of the tagged references is a subelement.
(Inherited from IndependentTag)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
RemoveReferences |  Removes the provided list of references from the tag's list of references.
(Inherited from IndependentTag)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetIsLeaderVisible |  Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
(Inherited from IndependentTag)
SetLeaderElbow |  Set the position of the elbow of the tag's leader that points to specified reference. If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
(Inherited from IndependentTag)
SetLeaderEnd |  Sets the free end point for the leader to the specified reference.
(Inherited from IndependentTag)
SetLeaderStart |  Sets the free leader start point for the leader to the specified reference.
(Inherited from IndependentTag)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace